---
kind: method
id: M:Autodesk.Revit.DB.ElementRecord.IsCurveDriven
source: html/6b23f209-a864-5a18-c663-5dbce7719e94.htm
---
# Autodesk.Revit.DB.ElementRecord.IsCurveDriven Method

Identifies if the element is curve driven.

## Syntax (C#)
```csharp
public bool IsCurveDriven()
```

## Returns
True if the element is curve driven.